## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_firewall.virtual_wan_fw01 will be created
  + resource "azurerm_firewall" "virtual_wan_fw01" {
      + dns_proxy_enabled   = (known after apply)
      + firewall_policy_id  = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus2"
      + name                = "acn-vwan-fw01"
      + resource_group_name = "accern-nwsvcs-prd-eus2-rg"
      + sku_name            = "AZFW_Hub"
      + sku_tier            = "Premium"
      + threat_intel_mode   = (known after apply)

      + virtual_hub {
          + private_ip_address  = (known after apply)
          + public_ip_addresses = (known after apply)
          + public_ip_count     = 1
          + virtual_hub_id      = "/subscriptions/3124b81f-32b6-49f2-98d6-7500ef2a165f/resourceGroups/accern-nwsvcs-prd-eus2-rg/providers/Microsoft.Network/virtualHubs/acn-virtual-hub-prd"
        }
    }

  # azurerm_firewall_policy.fw-pol01 will be created
  + resource "azurerm_firewall_policy" "fw-pol01" {
      + child_policies           = (known after apply)
      + firewalls                = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus2"
      + name                     = "fw-pol01"
      + resource_group_name      = "accern-nwsvcs-prd-eus2-rg"
      + rule_collection_groups   = (known after apply)
      + sku                      = (known after apply)
      + threat_intelligence_mode = "Alert"
    }

  # azurerm_firewall_policy_rule_collection_group.region1-policy1 will be created
  + resource "azurerm_firewall_policy_rule_collection_group" "region1-policy1" {
      + firewall_policy_id = (known after apply)
      + id                 = (known after apply)
      + name               = "fw-pol01-rules"
      + priority           = 100

      + network_rule_collection {
          + action   = "Allow"
          + name     = "network_rules1"
          + priority = 100

          + rule {
              + destination_addresses = [
                  + "*",
                ]
              + destination_ports     = [
                  + "*",
                ]
              + name                  = "network_rule_collection1_rule1"
              + protocols             = [
                  + "TCP",
                  + "UDP",
                  + "ICMP",
                ]
              + source_addresses      = [
                  + "*",
                ]
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>